app/views/sprints/_form.html.erb

    <div class="controls">
      <%= f.collection_select :team_id, Team.all,:id, :name, {:prompt => 'Select Team'}%>
---
SELECT "teams".* FROM "teams"