app/views/sprints/index.html.erb

SELECT "sprints".* FROM "sprints"
SELECT "stories".* FROM "stories" WHERE "stories"."sprint_id" = 1
SELECT COUNT(*) FROM "stories" WHERE "stories"."sprint_id" = 1
---
        <td><%= sprint.team.name %></td>
		<td><a href="<%= forsprint_story_path(sprint) %>" data-placement="right" rel="popover" data-content="<%=sprint.stories_for_sprint_total_effort%>  total effort for this sprint" data-original-title="<%= sprint.title %> story highlight"><span class="badge badge-info"><%= sprint.stories.count%></span></a></td>