app/views/stories/_form.html.erb

SELECT "sprints".* FROM "sprints"
---
    <div class="controls">
      <%= f.collection_select :sprint_id, Sprint.all,:id, :title, {:prompt => 'Select Sprint'}%>