app/views/stories/index.html.erb

        <td><%= story.sprint.title %></td>
		<td><span class="badge badge-info"><%= story.bugs.count %></span></td>
---
SELECT COUNT(*) FROM "bugs" WHERE "bugs"."story_id" = 1