app/views/stories/show.html.erb

<dt><strong><%= model_class.human_attribute_name(:bugs) %>:</strong></dt>
<dd><%= @story.bugs.count %></dd>
---
SELECT COUNT(*) FROM "bugs" WHERE "bugs"."story_id" = 1