app/views/bugs/_form.html.erb

    <div class="controls">
<%= f.collection_select :story_id, Story.all,:id, :name, {:prompt => 'Select Story'}%>
---
SELECT "stories".* FROM "stories"

    <div class="controls">
      <%= f.collection_select :bugarea_id, Bugarea.all,:id, :name, {:prompt => 'Select Bug Area'}%>
---
SELECT "bugareas".* FROM "bugareas"