app/controllers/bugareas_controller.rb

SELECT "bugareas".* FROM "bugareas"
---
  def index
    @bugareas = Bugarea.all

SELECT "bugareas".* FROM "bugareas" WHERE "bugareas"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @bugarea = Bugarea.find(params[:id])

INSERT INTO "bugareas" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 07 Mar 2013 13:14:51 UTC +00:00], ["name", "Design"], ["updated_at", Thu, 07 Mar 2013 13:14:51 UTC +00:00]]
---
  def create
    @bugarea = Bugarea.new(params[:bugarea])

    respond_to do |format|
      if @bugarea.save