app/controllers/bugs_controller.rb

  def index
    @bugs = Bug.all
---
SELECT "bugs".* FROM "bugs"

  def show
    @bug = Bug.find(params[:id])
---
SELECT "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT 1  [["id", "1"]]

  def forstory
    @story = Story.find(params[:id])
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @bug = Bug.find(params[:id])
---
SELECT "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @bug = Bug.new(params[:bug])

    respond_to do |format|
      if @bug.save
---
INSERT INTO "bugs" ("bugarea_id", "created_at", "description", "story_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["bugarea_id", 1], ["created_at", Mon, 11 Mar 2013 19:57:35 UTC +00:00], ["description", "gfdgf"], ["story_id", 1], ["title", "gfd"], ["updated_at", Mon, 11 Mar 2013 19:57:35 UTC +00:00]]

  def update
    @bug = Bug.find(params[:id])
---
SELECT "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT 1  [["id", "3"]]