app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories"
---
  def index
    @stories = Story.all

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @story = Story.find(params[:id])

SELECT "sprints".* FROM "sprints" WHERE "sprints"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "stories".* FROM "stories" WHERE "stories"."sprint_id" = 1 LIMIT 1
---
  def forsprint
    @stories = Sprint.find(params[:id]).stories

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @story = Story.find(params[:id])

INSERT INTO "stories" ("completed", "created_at", "description", "name", "sprint_id", "total_effort", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @story = Story.new(params[:story])

    respond_to do |format|
      if @story.save

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "stories" SET "total_effort" = 45.6, "updated_at" = '2013-03-08 15:58:23.758144' WHERE "stories"."id" = 1
---
  def update
    @story = Story.find(params[:id])

    respond_to do |format|
      if @story.update_attributes(params[:story])